DataProcessors/ДиаграммаОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ДиаграммаОтпусков</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/ЗаявкаНаОтпуск.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЗаявкаНаОтпуск</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОтпуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправленныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаОтпуск</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рассмотрел</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРассмотрения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/СтруктураПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СтруктураПредприятия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетСтруктуреЮридическихЛиц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтудентРаботающийВСтудотряде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьНаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыОтпусков</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтпускЯвляетсяЕжегодным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаОтпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаОтпуска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредоставлятьОтпускВсемСотрудникам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейВГод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтпускБезОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойОтпуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НакопительныйОтпуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерЗависимостиДнейОтпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХарактерЗависимостиКоличестваДнейОтпуска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСтажа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШкалаОценкиСтажа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВерхняяГраницаИнтервалаСтажа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДнейВГод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ДиаграммаОтпусков/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоПроизводственныхКалендарей") Тогда
		КалендарныеГрафики.ЗаполнитьПроизводственныйКалендарьВФорме(ЭтотОбъект, "ПроизводственныйКалендарь");
	Иначе
		ПроизводственныйКалендарь = Обработки.ДиаграммаОтпусков.БазовыйПроизводственныйКалендарь();
	КонецЕсли;
	
	Пользователь = Пользователи.АвторизованныйПользователь();
	Если ЗначениеЗаполнено(Пользователь) Тогда
		ФизическоеЛицоТекущегоПользователя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ФизическоеЛицо");
	КонецЕсли;
	ИнициализироватьКомпоновщик();
	Цвета = ЦветаПланировщика();
	ПодразделениеСотрудник = Справочники.СтруктураПредприятия.ПустаяСсылка();
	
	ОграниченныйДоступ = Не Пользователи.РолиДоступны("ПросмотрДокументовИзДиаграммыОтпусков");
	
	ДатаОтображения = ТекущаяДатаСеанса();
	ВариантОтображенияПериода = ВариантыПериода().Год;
	ОтображатьПлан = Истина;
	ОтображатьФакт = Истина;
	ВыделятьПраздничныеДни = Истина;
	
	Если Не ЕстьСохраненныеНастройки() Тогда
		ПриЗагрузкеНастроек();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ПриЗагрузкеНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьДанныеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ИменаСобытий = Новый Массив;
	ИменаСобытий.Добавить("Запись_ГрафикОтпусков");
	ИменаСобытий.Добавить("ЗаписанДокументОтпуск");
	ИменаСобытий.Добавить("ЗаписанДокументЗаявкаНаОтпуск");
	
	Если ИменаСобытий.Найти(ИмяСобытия) <> Неопределено Тогда
		НачатьОбновлениеДанныхНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодразделениеСотрудникПриИзменении(Элемент)
	
	Если ПодразделениеСотрудникСтароеЗначение <> ПодразделениеСотрудник Тогда
		Если ТипЗнч(ПодразделениеСотрудникСтароеЗначение) = ТипЗнч(ПодразделениеСотрудник)
			Или ЗначениеЗаполнено(ПодразделениеСотрудник) Тогда
			НачатьОбновлениеДанныхНаКлиенте();
		КонецЕсли;
		Если ПодразделениеСотрудник = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка") Тогда
			ПодразделениеСотрудник = ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка");
		КонецЕсли;
		ПодразделениеСотрудникСтароеЗначение = ПодразделениеСотрудник;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеСотрудникИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Если ПустаяСтрока(Текст) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеСотрудникОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	УстановитьПустоеПодразделение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеСотрудникАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание,
	СтандартнаяОбработка)
	
	Если СтрДлина(Текст) > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = РезультатПоиска(Текст);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗначениеЭлемента = Элемент.ВыделенныеЭлементы[0].Значение;
	Если ЗначениеЗаполнено(ЗначениеЭлемента) Тогда
		Сотрудник = Элемент.ВыделенныеЭлементы[0].ЗначенияИзмерений.Получить("ПодразделениеСотрудник");
		Если РазрешенПросмотрДанныхСотрудника(ОграниченныйДоступ, Сотрудник, ФизическоеЛицоТекущегоПользователя,
			ЗначениеЭлемента) Тогда
			ПоказатьЗначение(, ЗначениеЭлемента);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикОбработкаФормированияКоманд(Элемент, Параметры, Команды, КомандаПоУмолчанию)
	
	Команды.Очистить();
	
	// АПК:571-выкл не проверять конструктор ОписаниеКомандыПланировщика
	Если Параметры.Источник = ИсточникКомандПланировщика.Элементы Тогда
		ЗначениеЭлемента = Элемент.ВыделенныеЭлементы[0].Значение;
		Если ЗначениеЗаполнено(ЗначениеЭлемента) Тогда
			Сотрудник = Элемент.ВыделенныеЭлементы[0].ЗначенияИзмерений.Получить("ПодразделениеСотрудник");
			Если РазрешенПросмотрДанныхСотрудника(ОграниченныйДоступ, Сотрудник, ФизическоеЛицоТекущегоПользователя,
				ЗначениеЭлемента) Тогда
				КомандаРедактировать = Новый ОписаниеКомандыПланировщика(
					СтандартнаяКомандаПланировщика.РедактироватьЭлемент, НСтр("ru = 'Редактировать'"));
				КомандаРедактировать.Картинка = БиблиотекаКартинок.Изменить;
				Команды.Добавить(КомандаРедактировать);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Параметры.Источник = ИсточникКомандПланировщика.ЭлементИзмерения
		Или  Параметры.Источник = ИсточникКомандПланировщика.ПустаяОбластьЭлементов Тогда
		
		ЗначениеИзмерения = Параметры.ЗначенияИзмерений.Получить("ПодразделениеСотрудник");
		Если ТипЗнч(ЗначениеИзмерения) = Тип("СправочникСсылка.Сотрудники") 
			И РазрешенПросмотрДанныхСотрудника(ОграниченныйДоступ, ЗначениеИзмерения,
				ФизическоеЛицоТекущегоПользователя) Тогда
	
			ПараметрыЗаполнения = Новый Структура;
			ФизическоеЛицоСотрудника = ПолучитьФизическоеЛицо(ЗначениеИзмерения);
			ПараметрыЗаполнения.Вставить("ФизическоеЛицо", ФизическоеЛицоСотрудника);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьЗаявкуНаОтпуск", ЭтаФорма, ПараметрыЗаполнения);
			КомандаСоздатьЗаявку = Новый ОписаниеКомандыПланировщика(ОписаниеОповещения, НСтр("ru = 'Заявка на отпуск'"));
			КомандаСоздатьЗаявку.Картинка = БиблиотекаКартинок.СоздатьЭлементСписка;
			Команды.Добавить(КомандаСоздатьЗаявку);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьСправкуПоОтпускам", ЭтаФорма, ЗначениеИзмерения);
			КомандаСправка = Новый ОписаниеКомандыПланировщика(ОписаниеОповещения, НСтр("ru = 'Справка по отпускам'"));
			КомандаСправка.Картинка = БиблиотекаКартинок.Отчет;
			Команды.Добавить(КомандаСправка);
			
			Разделитель = Новый ОписаниеКомандыПланировщика(Неопределено, "-");
			Команды.Добавить(Разделитель);
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьДанные", ЭтаФорма);
		КомандаОбновить = Новый ОписаниеКомандыПланировщика(ОписаниеОповещения, НСтр("ru = 'Обновить'"));
		КомандаОбновить.Картинка = БиблиотекаКартинок.Обновить;
		Команды.Добавить(КомандаОбновить);
	КонецЕсли;
	
	Если Параметры.Источник = ИсточникКомандПланировщика.ПустаяОбластьЭлементов Тогда
		КомандаПоУмолчанию = Неопределено;
	КонецЕсли;
	// АПК:571-вкл
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикНажатиеНаЭлементеШкалыВремени(Элемент, ЭлементШкалыВремени, Дата)
	
	Если ЭлементШкалыВремени.Единица = ТипЕдиницыШкалыВремени.Месяц
		И ВариантОтображенияПериода <> ВариантыПериода().Месяц Тогда
		ДатаОтображения = НачалоМесяца(Дата);
		ВариантОтображенияПериода = ВариантыПериода().Месяц;
		ИзменитьВариантПериода();
	ИначеЕсли ЭлементШкалыВремени.Единица = ТипЕдиницыШкалыВремени.Квартал
		И ВариантОтображенияПериода <> ВариантыПериода().Квартал Тогда
		ДатаОтображения = НачалоКвартала(Дата);
		ВариантОтображенияПериода = ВариантыПериода().Квартал;
		ИзменитьВариантПериода();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикНажатиеНаЭлементеИзмерения(Элемент, ЭлементИзмерения, ЗначенияИзмерений, СтандартнаяОбработка)
	
	Если ОграниченныйДоступ Тогда
		СтандартнаяОбработка = Ложь;
	Иначе	
		ЗначениеИзмерения = ЗначенияИзмерений.Получить("ПодразделениеСотрудник");
		Если ТипЗнч(ЗначениеИзмерения) = Тип("Число")
			Или ТипЗнч(ЗначениеИзмерения) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
	
	ОтменаРедактирования = Истина;
	ВыделенныйЭлемент = Элемент.ВыделенныеЭлементы[0];
	ЗначениеЭлемента = ВыделенныйЭлемент.Значение;
	
	Если ТипЗнч(ЗначениеЭлемента) = Тип("ДокументСсылка.ЗаявкаНаОтпуск") Тогда
		Сотрудник = ВыделенныйЭлемент.ЗначенияИзмерений.Получить("ПодразделениеСотрудник");
		Если РазрешенПросмотрДанныхСотрудника(ОграниченныйДоступ, Сотрудник, ФизическоеЛицоТекущегоПользователя,
			ЗначениеЭлемента) И ФизическиеЛицаСовпадают(Сотрудник, ЗначениеЭлемента) Тогда
				
			ОтменаРедактирования = Ложь;
			НачатьРедактированиеЗаявки(ВыделенныйЭлемент);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьРедактированиеЗаявки(ВыделенныйЭлемент) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыделенныйЭлемент", ВыделенныйЭлемент);
	ДополнительныеПараметры.Вставить("ДатаНачала", ВыделенныйЭлемент.Начало);
	ДополнительныеПараметры.Вставить("ДатаОкончания", ВыделенныйЭлемент.Конец);
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьРедактированиеЗаявки", ЭтотОбъект, ДополнительныеПараметры);
	ТекстВопроса = СтрШаблон(НСтр("ru = 'Установить новый период заявки с %1 по %2?'"),
		Формат(ВыделенныйЭлемент.Начало, "ДЛФ=Д"), Формат(ВыделенныйЭлемент.Конец, "ДЛФ=Д"));
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактированиеЗаявки(Результат, Параметры) Экспорт

	ВыделенныйЭлемент = Параметры.ВыделенныйЭлемент;
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		УстановитьПериодЭлементаПоЗначению(ВыделенныйЭлемент);
		Возврат;
	КонецЕсли;
	
	ЗаявкаНаОтпуск = ВыделенныйЭлемент.Значение;
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗаявкаНаОтпуск", ЗаявкаНаОтпуск);
	ДополнительныеПараметры.Вставить("Сотрудник",
		ВыделенныйЭлемент.ЗначенияИзмерений.Получить("ПодразделениеСотрудник"));
	ДополнительныеПараметры.Вставить("ДатаНачала", Параметры.ДатаНачала);
	ДополнительныеПараметры.Вставить("ДатаОкончания",  Параметры.ДатаОкончания);
	
	Попытка
		ИзменитьПериодЗаявкиНаОтпуск(ДополнительныеПараметры);
		ВыделенныйЭлемент.Начало = Параметры.ДатаНачала;
		ВыделенныйЭлемент.Конец = Параметры.ДатаОкончания;
		ТекстОповещения = НСтр("ru = 'Изменена заявка на отпуск'");
		ПоказатьОповещениеПользователя(ТекстОповещения, ПолучитьНавигационнуюСсылку(ЗаявкаНаОтпуск),
			Строка(ЗаявкаНаОтпуск));
	Исключение
		УстановитьПериодЭлементаПоЗначению(ВыделенныйЭлемент);
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказыватьВсе(Команда)
	ИзменитьВариантОтображения(Истина, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьТолькоПлан(Команда)
	ИзменитьВариантОтображения(Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьТолькоФакт(Команда)
	ИзменитьВариантОтображения(Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьДанныеНаКлиенте();
КонецПроцедуры

// Переключает вариант периода на "Месяц"
&НаКлиенте
Процедура УстановитьПериодМесяц(Команда)
	
	ВариантОтображенияПериода = ВариантыПериода().Месяц;
	ДатаОтображения = НачалоМесяца(ДатаОтображения);
	ИзменитьВариантПериода();
	
КонецПроцедуры

// Переключает вариант периода на "Квартал"
&НаКлиенте
Процедура УстановитьПериодКвартал(Команда)
	
	ВариантОтображенияПериода = ВариантыПериода().Квартал;
	ДатаОтображения = НачалоКвартала(ДатаОтображения);
	ИзменитьВариантПериода();
	
КонецПроцедуры

// Переключает вариант периода на "Год"
&НаКлиенте
Процедура УстановитьПериодГод(Команда)
	
	ВариантОтображенияПериода = ВариантыПериода().Год;
	ДатаОтображения = НачалоГода(ДатаОтображения);
	ИзменитьВариантПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура Вперед(Команда)
	
	ОтключитьОбработчикОжидания("ОбновитьДанныеНаКлиентеОтложенно");
	
	Если ВариантОтображенияПериода = ВариантыПериода().Месяц Тогда
		ДатаОтображения = НачалоМесяца(ДобавитьМесяц(ДатаОтображения, 1));
	ИначеЕсли ВариантОтображенияПериода = ВариантыПериода().Квартал Тогда
		ДатаОтображения = НачалоКвартала(ДобавитьМесяц(ДатаОтображения, 3));
	ИначеЕсли ВариантОтображенияПериода = ВариантыПериода().Год Тогда
		ДатаОтображения = НачалоГода(ДобавитьМесяц(ДатаОтображения, 12));
	КонецЕсли;
	
	ПриИзмененииПериодаОтображения();
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	ОтключитьОбработчикОжидания("ОбновитьДанныеНаКлиентеОтложенно");
	
	Если ВариантОтображенияПериода = ВариантыПериода().Месяц Тогда
		ДатаОтображения = НачалоМесяца(ДобавитьМесяц(ДатаОтображения, -1));
	ИначеЕсли ВариантОтображенияПериода = ВариантыПериода().Квартал Тогда
		ДатаОтображения = НачалоКвартала(ДобавитьМесяц(ДатаОтображения, -3));
	ИначеЕсли ВариантОтображенияПериода = ВариантыПериода().Год Тогда
		ДатаОтображения = НачалоГода(ДобавитьМесяц(ДатаОтображения, -12));
	КонецЕсли;
	
	ПриИзмененииПериодаОтображения();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделятьПраздничныеДни(Команда)
	
	ВыделятьПраздничныеДни = Не ВыделятьПраздничныеДни;
	Если ВыделятьПраздничныеДни Тогда
		ЗаполнитьПраздничныеДни(ПраздничныеДни, ПроизводственныйКалендарь, ПериодДанных.ДатаНачала,
			ПериодДанных.ДатаОкончания);
	КонецЕсли;
	ОтобразитьПраздничныеДни();
	Элементы.ВыделятьПраздничныеДни.Пометка = ВыделятьПраздничныеДни;
	УстановитьОтображениеДиаграммыГанта();
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ОбновитьДиаграммуГантаНаСервере();
	Заголовок = ТекстПериода(ПериодДанных.ДатаНачала, ПериодДанных.ДатаОкончания);
	
	МассивОбъектов =
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка"));
	ПараметрыПечати = Новый Структура("ИсходнаяДиаграмма, Заголовок", ДиаграммаГанта, Заголовок);
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ДиаграммаОтпусков", "ДиаграммаОтпусков", МассивОбъектов,
		ЭтотОбъект, ПараметрыПечати);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтборы(Команда)
	НачатьУстановкуОтборов();
КонецПроцедуры

&НаКлиенте
Процедура НачатьУстановкуОтборов()
	
	ПараметрыФормы = Новый Структура("КомпоновщикНастроек", КомпоновщикНастроек);
	ОткрытьФорму("Обработка.ДиаграммаОтпусков.Форма.ФормаОтборов", ПараметрыФормы, ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ЗавершитьУстановкуОтборов", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьУстановкуОтборов(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		КомпоновщикНастроек = РезультатЗакрытия;
		НачатьОбновлениеДанныхНаКлиенте();
		УстановитьЗаголовокОтборов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПроизводственныйКалендарь(Команда)
	НачатьУстановкуПроизводственногоКалендаря();
КонецПроцедуры

&НаКлиенте
Процедура НачатьУстановкуПроизводственногоКалендаря()
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьУстановкуПроизводственногоКалендаря", ЭтотОбъект);
	ОткрытьФорму("Справочник.ПроизводственныеКалендари.ФормаВыбора", , ЭтотОбъект, , , ,
		Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьУстановкуПроизводственногоКалендаря(РезультатВыбора, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(РезультатВыбора) Тогда
		ПроизводственныйКалендарь = РезультатВыбора;
		ВыделятьПраздничныеДни = Истина;
		Элементы.ВыделятьПраздничныеДни.Пометка = Истина;
	КонецЕсли;
	
	УстановитьЗаголовокВидимостьКомандПроизводственногоКалендаря();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает период отображения Планировщика на основе текущих настроек
// 
// Параметры:
//  ВариантОтображенияПериода - Строка - "Месяц", "Квартал", "Год"
//  ДатаОтображения - Дата - текущая дата отображения
// 
// Возвращаемое значение:
//  СтандартныйПериод
//
&НаКлиентеНаСервереБезКонтекста
Функция ПериодДанных(ВариантОтображенияПериода, ДатаОтображения)
	
	Результат = Новый СтандартныйПериод();
	
	ВариантыПериода = ВариантыПериода();
	Если ВариантОтображенияПериода = ВариантыПериода.Месяц Тогда
		Результат.ДатаНачала = НачалоМесяца(ДатаОтображения);
		Результат.ДатаОкончания = КонецМесяца(ДатаОтображения);
	ИначеЕсли ВариантОтображенияПериода = ВариантыПериода.Квартал Тогда
		Результат.ДатаНачала = НачалоКвартала(ДатаОтображения);
		Результат.ДатаОкончания = КонецКвартала(ДатаОтображения);
	Иначе
		Результат.ДатаНачала = НачалоГода(ДатаОтображения);
		Результат.ДатаОкончания = КонецГода(ДатаОтображения);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ДобавитьЭлементПланировщика(Знач Параметры)

	Сотрудник = Параметры.Сотрудник;
	Выборка = Параметры.Выборка;
	ВариантОтображенияПериода = Параметры.ВариантОтображенияПериода;
	
	ДатаНачала = Выборка.ДатаНачала;
	ДатаОкончания = КонецДня(Выборка.ДатаОкончания);
	
	ПредставлениеПериода = СтрШаблон(НСтр("ru = '%1 - %2'"), Формат(ДатаНачала, "ДЛФ=Д"), Формат(ДатаОкончания, "ДЛФ=Д"));
	
	Элемент = Планировщик.Элементы.Добавить(ДатаНачала, ДатаОкончания);
	ВидыОтпуска = Обработки.ДиаграммаОтпусков.ВидыОтпуска();
	
	Если Выборка.ВидОтпуска = ВидыОтпуска.Отпуск Тогда
		ПараметрыПолученияКоличестваДней = Новый Структура;
		ПараметрыПолученияКоличестваДней.Вставить("Сотрудник", Сотрудник);
		ПараметрыПолученияКоличестваДней.Вставить("ДатаНачала", ДатаНачала);
		ПараметрыПолученияКоличестваДней.Вставить("ДатаОкончания", ДатаОкончания);
		КоличествоДней = КоличествоДней(ПараметрыПолученияКоличестваДней);
	Иначе
		КоличествоДней = Выборка.КоличествоДней;
	КонецЕсли;
	
	Элемент.Текст = ТекстЭлемента(ВариантОтображенияПериода, КоличествоДней);
	Элемент.Значение = Выборка.ДокументОснование;
	Элемент.Подсказка = СтрШаблон(НСтр("ru = '%1 %2%3'"), ПредставлениеПериода, Символы.ПС,
		Выборка.ДокументОснованиеПредставление);
	
	Измерения = Новый Соответствие;
	Измерения.Вставить("ПодразделениеСотрудник", Сотрудник);
	Элемент.ЗначенияИзмерений = Новый ФиксированноеСоответствие(Измерения);
	Если Выборка.ВидОтпуска = ВидыОтпуска.График Тогда
		Элемент.ЦветФона = Цвета.ЦветПлана;
	ИначеЕсли Выборка.ВидОтпуска = ВидыОтпуска.Отпуск Или Выборка.ВидОтпуска = ВидыОтпуска.Заявка Тогда
		Элемент.ЦветФона = Цвета.ЦветФакта;
	ИначеЕсли Выборка.ВидОтпуска = ВидыОтпуска.ЗаявкаНеСогласованная Тогда
		Элемент.ЦветФона = Цвета.ЦветЗаявки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыПланировщика(ПериодыСотрудников, Знач Параметры)
	
	Для Каждого КлючЗначение Из ПериодыСотрудников Цикл
		Сотрудник = КлючЗначение.Ключ;
		ТаблицаПериодов = КлючЗначение.Значение;
		Если ТаблицаПериодов = Неопределено Или ТаблицаПериодов.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Параметры.Вставить("Сотрудник", Сотрудник);
		
		Параметры.Вставить("ЭтоТекущийПользователь",
			ТаблицаПериодов[0].ФизическоеЛицо = ФизическоеЛицоТекущегоПользователя);
		
		ПериодыФакт = ТаблицаПериодов.НайтиСтроки(Новый Структура("Приоритет", ПриоритетыОтпусков().Факт));
		Для Каждого ПериодФакт Из ПериодыФакт Цикл
			Параметры.Вставить("Выборка", ПериодФакт);
			ДобавитьЭлементПланировщика(Параметры);
		КонецЦикла;
		
		ВывестиПлановыеПериоды(ТаблицаПериодов, ПериодыФакт, Параметры);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиПлановыеПериоды(ТаблицаПериодов, ПериодыФакт, Знач Параметры)

	ОписаниеВидаОтпуска = Параметры.ОписаниеВидаОтпуска;
	Сотрудник = Параметры.Сотрудник;
	
	Для Каждого СтрокаПериод Из ТаблицаПериодов Цикл
		Параметры.Вставить("Выборка", СтрокаПериод);
		Если СтрокаПериод.Приоритет = ПриоритетыОтпусков().Факт Тогда
			Продолжить;
		КонецЕсли;
		
		ПериодыПлан = ТаблицаПериодов.СкопироватьКолонки();
		ЕстьПересечение = Ложь;
		Для Каждого ПериодФакт Из ПериодыФакт Цикл
			Если ОбщегоНазначенияБЗК.ИнтервалыПересекаются(СтрокаПериод.ДатаНачала,	КонецДня(СтрокаПериод.ДатаОкончания),
				ПериодФакт.ДатаНачала, КонецДня(ПериодФакт.ДатаОкончания)) Тогда
				
				ЕстьПересечение = Истина;
				ПериодПересечения = ОбщегоНазначенияБЗК.ПериодПересеченияДвухИнтервалов(СтрокаПериод.ДатаНачала,
					КонецДня(СтрокаПериод.ДатаОкончания), ПериодФакт.ДатаНачала, КонецДня(ПериодФакт.ДатаОкончания));
				Если ПериодПересечения.ДатаНачала = СтрокаПериод.ДатаНачала
					И ПериодПересечения.ДатаОкончания = КонецДня(СтрокаПериод.ДатаОкончания) Тогда
					Прервать;	
				ИначеЕсли ПериодПересечения.ДатаНачала > СтрокаПериод.ДатаНачала
					И ПериодПересечения.ДатаОкончания = КонецДня(СтрокаПериод.ДатаОкончания) Тогда
					ПериодыПлан.Очистить();
					НоваяСтрока = ПериодыПлан.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПериод);
					НоваяСтрока.ДатаОкончания = ПериодПересечения.ДатаНачала - 1;
					НоваяСтрока.КоличествоДней = УчетРабочегоВремениРасширенный.ДлительностьИнтервала(Сотрудник,
						НоваяСтрока.ДатаНачала, НоваяСтрока.ДатаОкончания,
						ОписаниеВидаОтпуска.СпособРасчетаПоКалендарнымДням, ОписаниеВидаОтпуска.ЕжегодныйОтпуск);
					СтрокаПериод.ДатаОкончания = НоваяСтрока.ДатаОкончания;
				ИначеЕсли ПериодПересечения.ДатаНачала = СтрокаПериод.ДатаНачала
					И ПериодПересечения.ДатаОкончания < КонецДня(СтрокаПериод.ДатаОкончания) Тогда
					ПериодыПлан.Очистить();
					НоваяСтрока = ПериодыПлан.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПериод);
					НоваяСтрока.ДатаНачала = ПериодПересечения.ДатаОкончания + 1;
					НоваяСтрока.КоличествоДней = УчетРабочегоВремениРасширенный.ДлительностьИнтервала(Сотрудник,
						НоваяСтрока.ДатаНачала, НоваяСтрока.ДатаОкончания,
						ОписаниеВидаОтпуска.СпособРасчетаПоКалендарнымДням, ОписаниеВидаОтпуска.ЕжегодныйОтпуск);
					СтрокаПериод.ДатаНачала = НоваяСтрока.ДатаНачала;
				ИначеЕсли ПериодПересечения.ДатаНачала > СтрокаПериод.ДатаНачала
					И ПериодПересечения.ДатаОкончания < КонецДня(СтрокаПериод.ДатаОкончания) Тогда
					ПериодыПлан.Очистить();
					НоваяСтрока = ПериодыПлан.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПериод);
					НоваяСтрока.ДатаОкончания = ПериодПересечения.ДатаНачала - 1;	
					НоваяСтрока.КоличествоДней = УчетРабочегоВремениРасширенный.ДлительностьИнтервала(Сотрудник,
						НоваяСтрока.ДатаНачала, НоваяСтрока.ДатаОкончания,
						ОписаниеВидаОтпуска.СпособРасчетаПоКалендарнымДням, ОписаниеВидаОтпуска.ЕжегодныйОтпуск);
					НоваяСтрока = ПериодыПлан.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПериод);
					НоваяСтрока.ДатаНачала = ПериодПересечения.ДатаОкончания + 1;
					НоваяСтрока.КоличествоДней = УчетРабочегоВремениРасширенный.ДлительностьИнтервала(Сотрудник,
						НоваяСтрока.ДатаНачала, НоваяСтрока.ДатаОкончания,
						ОписаниеВидаОтпуска.СпособРасчетаПоКалендарнымДням, ОписаниеВидаОтпуска.ЕжегодныйОтпуск);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ЕстьПересечение Тогда
			ДобавитьЭлементПланировщика(Параметры);
		КонецЕсли;
		
		Если ЕстьПересечение И ПериодыПлан.Количество() > 0 Тогда
			ВывестиПлановыеПериоды(ПериодыПлан, ПериодыФакт, Параметры);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ВывестиДанныеПланировщика(Знач Параметры, КоличествоЭлементовИзмерения)
	
	РезультатЗапроса = Параметры.ДанныеОтпусков;
	ИзмерениеПодразделениеСотрудник = Параметры.ИзмерениеПодразделениеСотрудник;
	
	ПериодыСотрудников = Новый Соответствие;
	Выборка = РезультатЗапроса.Выбрать();
	
	ПараметрыВывода = Новый Структура;
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыВывода, Параметры, Истина);
	ПараметрыВывода.Вставить("Выборка", Выборка);
	
	Пока Выборка.Следующий() Цикл
		Сотрудник = Выборка.Сотрудник;
		ПараметрыВывода.Вставить("Сотрудник", Сотрудник);
		ЭлементСотрудник = ИзмерениеПодразделениеСотрудник.Элементы.Найти(Сотрудник);
		Если ЭлементСотрудник = Неопределено Тогда
			ЭлементСотрудник = ИзмерениеПодразделениеСотрудник.Элементы.Добавить(Сотрудник);
			ПараметрыВывода.Вставить("ЭлементСотрудник", ЭлементСотрудник);
			ПараметрыВывода.Вставить("ЭтоТекущийПользователь", Ложь);
			КоличествоЭлементовИзмерения = КоличествоЭлементовИзмерения + 1;
			ВывестиСотрудника(ПараметрыВывода, ПериодыСотрудников);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ДокументОснование) Тогда
			ВывестиДокумент(ПараметрыВывода, ПериодыСотрудников);
		КонецЕсли;
	КонецЦикла;
	
	Если ОтображатьПлан И ОтображатьФакт Тогда
		ДобавитьЭлементыПланировщика(ПериодыСотрудников, ПараметрыВывода);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиСотрудника(Параметры, ПериодыСотрудников)
	
	Если Параметры.Выборка.ФизическоеЛицо = Параметры.ФизическоеЛицоТекущегоПользователя Тогда
		Параметры.ЭтоТекущийПользователь = Истина;
		Параметры.ЭлементСотрудник.ЦветФона = Цвета.ЦветФонаТекущегоСотрудника;
		Интервал = Планировщик.ИнтервалыФона.Добавить(ПериодДанных.ДатаНачала, ПериодДанных.ДатаОкончания);
		Соответствие = Новый Соответствие;
		Соответствие.Вставить(Параметры.ИзмерениеПодразделениеСотрудник.Значение, Параметры.Сотрудник);
		Интервал.ЗначенияИзмерений = Новый ФиксированноеСоответствие(Соответствие);
		Интервал.Цвет = Цвета.ЦветФонаТекущегоСотрудника;
	КонецЕсли;
	Если Параметры.Свойство("ОбработанныеСотрудники") Тогда
		Параметры.ОбработанныеСотрудники.Вставить(Параметры.Сотрудник, Параметры.Сотрудник);
	КонецЕсли;
	Если ОтображатьПлан И ОтображатьФакт Тогда
		ПериодыСотрудников.Вставить(Параметры.Сотрудник, НоваяТаблицаПериодов()); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиДокумент(Параметры, ПериодыСотрудников)
	
	Если ОтображатьПлан И ОтображатьФакт Тогда
		НоваяСтрока = ПериодыСотрудников.Получить(Параметры.Сотрудник).Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Параметры.Выборка);
	Иначе	
		ДобавитьЭлементПланировщика(Параметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтображениеЭлементов(Форма, ВыделятьПраздничныеДни)
	
	УстановитьПредставлениеПериода(Форма);
	УстановитьЗаголовкиКнопокПериода(Форма);
	ВыделитьПериодОтображения(Форма);
	ВыделитьВариантОтображения(Форма);
	Форма.Элементы.ВыделятьПраздничныеДни.Пометка = ВыделятьПраздничныеДни;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВыделитьПериодОтображения(Форма)
	
	Форма.Элементы.ФормаМесяц.Пометка = Ложь;
	Форма.Элементы.ФормаКвартал.Пометка = Ложь;
	Форма.Элементы.ФормаГод.Пометка = Ложь;
	
	ВариантыПериода = ВариантыПериода();
	Если Форма.ВариантОтображенияПериода = ВариантыПериода.Месяц Тогда
		Форма.Элементы.ФормаМесяц.Пометка = Истина;
	ИначеЕсли Форма.ВариантОтображенияПериода = ВариантыПериода.Квартал Тогда
		Форма.Элементы.ФормаКвартал.Пометка = Истина;
	ИначеЕсли Форма.ВариантОтображенияПериода = ВариантыПериода.Год Тогда
		Форма.Элементы.ФормаГод.Пометка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВыделитьВариантОтображения(Форма)
	
	Форма.Элементы.КнопкаВсе.Пометка = Ложь;
	Форма.Элементы.КнопкаПлан.Пометка = Ложь;
	Форма.Элементы.КнопкаФакт.Пометка = Ложь;
	
	Если Форма.ОтображатьПлан И Форма.ОтображатьФакт Тогда
		Форма.Элементы.КнопкаВсе.Пометка = Истина;
	ИначеЕсли Форма.ОтображатьПлан Тогда
		Форма.Элементы.КнопкаПлан.Пометка = Истина;
	ИначеЕсли Форма.ОтображатьФакт Тогда
		Форма.Элементы.КнопкаФакт.Пометка = Истина;
	Иначе
		Форма.ОтображатьПлан = Истина;
		Форма.ОтображатьФакт = Истина;
		Форма.Элементы.КнопкаВсе.Пометка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеПериода(Форма)
	Форма.Заголовок = ТекстПериода(Форма.ПериодДанных.ДатаНачала, Форма.ПериодДанных.ДатаОкончания);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиКнопокПериода(Форма)
	
	// АПК:1367-выкл форматирование не работает в вэб-клиенте
	Форма.Элементы.ФормаМесяц.Заголовок = Формат(Форма.ДатаОтображения, "ДФ=""ММММ гггг""");
	Форма.Элементы.ФормаКвартал.Заголовок = Формат(Форма.ДатаОтображения, "ДФ=""к 'квартал' гггг""");
	// АПК:1367-вкл
	Форма.Элементы.ФормаГод.Заголовок = Формат(Форма.ДатаОтображения, НСтр("ru = 'ДФ=гггг'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьПраздничныеДни()

	Планировщик.ИнтервалыФона.Очистить();
	Если ВыделятьПраздничныеДни Тогда
		Для Каждого ЭлементСписка Из ПраздничныеДни Цикл
			Интервал = Планировщик.ИнтервалыФона.Добавить(ЭлементСписка.Значение, КонецДня(ЭлементСписка.Значение));
			Интервал.Цвет = Цвета.ЦветПраздничныхДней;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтображениеПланировщика()
	
	ОтобразитьПраздничныеДни();
	
	КоличествоШкал = Планировщик.ШкалаВремени.Элементы.Количество();
	Если КоличествоШкал = 1 Тогда
		Планировщик.ШкалаВремени.Элементы.Добавить();
	ИначеЕсли КоличествоШкал = 3 Тогда
		Планировщик.ШкалаВремени.Элементы.Удалить(Планировщик.ШкалаВремени.Элементы[2]);
	КонецЕсли;
	
	Если ВариантОтображенияПериода = ВариантыПериода().Месяц Тогда
		Планировщик.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.День;
		Планировщик.КратностьПериодическогоВарианта = ЗарплатаКадрыКлиентСервер.КоличествоДнейМесяца(ПериодДанных.ДатаНачала);
		Планировщик.ШкалаВремени.Элементы[0].Формат = "ДФ=""ММММ гггг 'год'""";
		Планировщик.ШкалаВремени.Элементы[0].Единица = ТипЕдиницыШкалыВремени.Месяц;
		Планировщик.ШкалаВремени.Элементы[0].Кратность = 1;
		Планировщик.ШкалаВремени.Элементы[1].Формат = "ДФ=дд";
		Планировщик.ШкалаВремени.Элементы[1].Единица = ТипЕдиницыШкалыВремени.День;
		Планировщик.ШкалаВремени.Элементы[1].Кратность = 1;
		Элементы.Планировщик.ГиперссылкаЭлементаШкалыВремени = Ложь;
	ИначеЕсли ВариантОтображенияПериода = ВариантыПериода().Квартал Тогда
		Планировщик.ШкалаВремени.Элементы.Добавить();
		Планировщик.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Месяц;
		Планировщик.КратностьПериодическогоВарианта = 3;
		Планировщик.ШкалаВремени.Элементы[0].Формат = "ДФ=""к 'квартал' гггг 'года'""";
		Планировщик.ШкалаВремени.Элементы[0].Единица = ТипЕдиницыШкалыВремени.Квартал;
		Планировщик.ШкалаВремени.Элементы[0].Кратность = 1;
		Планировщик.ШкалаВремени.Элементы[1].Формат = "ДФ=MMMM";
		Планировщик.ШкалаВремени.Элементы[1].Единица = ТипЕдиницыШкалыВремени.Месяц;
		Планировщик.ШкалаВремени.Элементы[1].Кратность = 1;
		Планировщик.ШкалаВремени.Элементы[2].Формат = "ДФ=дд";
		Планировщик.ШкалаВремени.Элементы[2].Единица = ТипЕдиницыШкалыВремени.Неделя;
		Планировщик.ШкалаВремени.Элементы[2].Кратность = 1;
		Элементы.Планировщик.ГиперссылкаЭлементаШкалыВремени = Истина;
	ИначеЕсли ВариантОтображенияПериода = ВариантыПериода().Год Тогда
		Планировщик.ШкалаВремени.Элементы.Добавить();
		Планировщик.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Месяц;
		Планировщик.КратностьПериодическогоВарианта = 12;
		Планировщик.ШкалаВремени.Элементы[0].Формат = "ДФ=""гггг 'год'""";
		Планировщик.ШкалаВремени.Элементы[0].Единица = ТипЕдиницыШкалыВремени.Год;
		Планировщик.ШкалаВремени.Элементы[0].Кратность = 1;
		Планировщик.ШкалаВремени.Элементы[1].Формат = "ДФ=""к 'квартал'""";
		Планировщик.ШкалаВремени.Элементы[1].Единица = ТипЕдиницыШкалыВремени.Квартал;
		Планировщик.ШкалаВремени.Элементы[1].Кратность = 1;
		Планировщик.ШкалаВремени.Элементы[2].Формат = "ДФ=MMMM";
		Планировщик.ШкалаВремени.Элементы[2].Единица = ТипЕдиницыШкалыВремени.Месяц;
		Планировщик.ШкалаВремени.Элементы[2].Кратность = 1;
		Элементы.Планировщик.ГиперссылкаЭлементаШкалыВремени = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтображениеДиаграммыГанта()
	
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.ИнтервалыФона.Очистить();
	
	ШкалаВремени = ДиаграммаГанта.ОбластьПостроения.ШкалаВремени;
	
	КоличествоШкал = ШкалаВремени.Элементы.Количество();
	Если КоличествоШкал = 1 Тогда
		ШкалаВремени.Элементы.Добавить();
	ИначеЕсли КоличествоШкал = 3 Тогда
		ШкалаВремени.Элементы.Удалить(ШкалаВремени.Элементы[2]);
	КонецЕсли;
	
	Если ВыделятьПраздничныеДни Тогда
		Для Каждого ЭлементСписка Из ПраздничныеДни Цикл
			Интервал = ДиаграммаГанта.ИнтервалыФона.Добавить(ЭлементСписка.Значение, КонецДня(ЭлементСписка.Значение));
			Интервал.Цвет = Цвета.ЦветПраздничныхДней;
		КонецЦикла;
	КонецЕсли;
	
	Если ВариантОтображенияПериода = ВариантыПериода().Месяц Тогда
		СтрокаШкалыВремени = ШкалаВремени.Элементы[0];
		СтрокаШкалыВремени.Единица = ТипЕдиницыШкалыВремени.Месяц;
		СтрокаШкалыВремени.Формат = "ДФ=""ММММ гггг 'год'""";
		СтрокаШкалыВремени = ШкалаВремени.Элементы[1];
		СтрокаШкалыВремени.Единица = ТипЕдиницыШкалыВремени.День;
		СтрокаШкалыВремени.Формат = "ДФ=дд";
	ИначеЕсли ВариантОтображенияПериода = ВариантыПериода().Квартал Тогда
		СтрокаШкалыВремени = ШкалаВремени.Элементы.Добавить();
		СтрокаШкалыВремени = ШкалаВремени.Элементы[0];
		СтрокаШкалыВремени.Единица = ТипЕдиницыШкалыВремени.Квартал;
		СтрокаШкалыВремени.Формат = "ДФ=""к 'квартал' гггг 'года'""";
		СтрокаШкалыВремени = ШкалаВремени.Элементы[1];
		СтрокаШкалыВремени.Единица = ТипЕдиницыШкалыВремени.Месяц;
		СтрокаШкалыВремени.Формат = "ДФ=ММMМ";
		СтрокаШкалыВремени = ШкалаВремени.Элементы[2];
		СтрокаШкалыВремени.Единица = ТипЕдиницыШкалыВремени.Неделя;
		СтрокаШкалыВремени.Формат = "ДФ=дд";
	Иначе
		ОбщегоНазначенияКлиентСервер.Проверить(ВариантОтображенияПериода = ВариантыПериода().Год,
			СтрШаблон(НСтр("ru = 'Неизвестный вид отображения периода %1'"), ВариантОтображенияПериода));
		СтрокаШкалыВремени = ШкалаВремени.Элементы.Добавить();
		СтрокаШкалыВремени = ШкалаВремени.Элементы[0];
		СтрокаШкалыВремени.Единица = ТипЕдиницыШкалыВремени.Год;
		СтрокаШкалыВремени.Формат = "ДФ=""гггг 'год'""";
		СтрокаШкалыВремени = ШкалаВремени.Элементы[1];
		СтрокаШкалыВремени.Единица = ТипЕдиницыШкалыВремени.Квартал;
		СтрокаШкалыВремени.Формат = "ДФ=""к 'квартал'""";
		СтрокаШкалыВремени = ШкалаВремени.Элементы[2];
		СтрокаШкалыВремени.Единица = ТипЕдиницыШкалыВремени.Месяц;
		СтрокаШкалыВремени.Формат = "ДФ=ММММ";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеНаКлиенте(ОбновитьДанные = Истина)
	
	УстановитьОтображениеПланировщика();
	Планировщик.ТекущиеПериодыОтображения.Очистить();
	Планировщик.ТекущиеПериодыОтображения.Добавить(ПериодДанных.ДатаНачала, ПериодДанных.ДатаОкончания);
	
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.УстановитьПолныйИнтервал(ПериодДанных.ДатаНачала, ПериодДанных.ДатаОкончания);
	УстановитьОтображениеДиаграммыГанта();
	
	Если ОбновитьДанные Тогда
		НачатьОбновлениеДанныхНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеНаСервере()
	
	КоличествоЭлементовИзмерения = 0;
	Планировщик.Измерения.Очистить();
	Планировщик.Элементы.Очистить();
	
	ПараметрыПолученияДанных = ПараметрыПолученияДанных();
	ДанныеОтпусков = ДанныеОтпусков(ПараметрыПолученияДанных, АдресДанныеОтпусков, УникальныйИдентификатор);
	
	ИзмерениеПодразделениеСотрудник = Планировщик.Измерения.Добавить("ПодразделениеСотрудник");
	ИзмерениеПодразделениеСотрудник.Текст = " ";
	
	ПараметрыВывода = ПараметрыВывода();
	ПараметрыВывода.Вставить("ДанныеОтпусков", ДанныеОтпусков);
	ПараметрыВывода.Вставить("ИзмерениеПодразделениеСотрудник", ИзмерениеПодразделениеСотрудник);
	ПараметрыВывода.Вставить("ОписаниеВидаОтпуска",
		ОстаткиОтпусков.ОписаниеВидаОтпуска(Справочники.ВидыОтпусков.Основной));
	
	ВывестиДанныеПланировщика(ПараметрыВывода, КоличествоЭлементовИзмерения);
	
	Если КоличествоЭлементовИзмерения < МаксимальноеКоличествоОтображаемыхЭлементовИзмерения() Тогда
		Для Счетчик = 1 По МаксимальноеКоличествоОтображаемыхЭлементовИзмерения() - КоличествоЭлементовИзмерения Цикл
			НовыйЭлемент = ИзмерениеПодразделениеСотрудник.Элементы.Добавить(Счетчик);
			НовыйЭлемент.Текст = " ";
		КонецЦикла;
	КонецЕсли;
	
	Если ПроизводственныйКалендарь.Пустая() Тогда
		ДанныеОтпусковТаблица = ДанныеОтпусков.Выгрузить();
		Графики = ОбщегоНазначения.ВыгрузитьКолонку(ДанныеОтпусковТаблица, "ГрафикРаботы", Истина);
		ПроизводственныйКалендарь = ПроизводственныйКалендарьПоГрафикам(Графики);
		ВыделятьПраздничныеДни = Не ПроизводственныйКалендарь.Пустая();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммуГантаНаСервере()
	
	ДиаграммаГанта.Очистить();
	
	ПараметрыПолученияДанных = ПараметрыПолученияДанных();
	ДанныеОтпусков = ДанныеОтпусков(ПараметрыПолученияДанных, АдресДанныеОтпусков, УникальныйИдентификатор);
	
	ПараметрыВывода = ПараметрыВывода();
	ПараметрыВывода.Вставить("ДанныеОтпусков", ДанныеОтпусков);
	
	ДанныеОтпусков = ДанныеОтпусков.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ДиаграммаГанта.УстановитьСерию(НСтр("ru = 'Отпуска'"));
	ВывестиДанныеДереваРекурсивно(ДиаграммаГанта, ДанныеОтпусков.Строки, ПараметрыВывода);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиДанныеДереваРекурсивно(ДиаграммаГанта, СтрокиДерева, Параметры, ТекущийРодитель = Неопределено)
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		Если СтрокаДерева.Сотрудник = Null Тогда
			НовыйРодитель = Неопределено;
			ВывестиДанныеДереваРекурсивно(ДиаграммаГанта, СтрокаДерева.Строки, Параметры, НовыйРодитель);
		Иначе
			ТочкаСотрудника = ДиаграммаГанта.УстановитьТочку(СтрокаДерева.Сотрудник, ТекущийРодитель);
			
			СтрокаОтпуска = СтрокаДерева;
				
			Если Не ЗначениеЗаполнено(СтрокаОтпуска.ДатаНачала) Тогда
				Продолжить;
			КонецЕсли;
			
			Расшифровка = Новый Структура;
			Расшифровка.Вставить("НачалоПериода", СтрокаОтпуска.ДатаНачала);
			Расшифровка.Вставить("ОкончаниеПериода", СтрокаОтпуска.ДатаОкончания);
			Расшифровка.Вставить("ДокументПланирования", СтрокаОтпуска.ДокументОснование);
			
			СерияОтпуска = ДиаграммаГанта.УстановитьСерию(НСтр("ru = 'Отпуска'"));
			СерияОтпуска.ДополнительныйЦвет = Параметры.Цвета.ЦветФакта;
			
			ПараметрыИнтервала = Новый Структура;
			ПараметрыИнтервала.Вставить("Расшифровка", Расшифровка);
			ПараметрыИнтервала.Вставить("СерияИнтервала", СерияОтпуска);
			ПараметрыИнтервала.Вставить("ДиаграммаГанта", ДиаграммаГанта);
			ПараметрыИнтервала.Вставить("ТочкаДиаграммыГанта", ТочкаСотрудника);
			
			ВидыОтпуска = Обработки.ДиаграммаОтпусков.ВидыОтпуска();
			
			Если СтрокаОтпуска.ВидОтпуска = ВидыОтпуска.Отпуск Тогда
				КоличествоДней = КоличествоДней(СтрокаОтпуска);
			Иначе
				КоличествоДней = СтрокаОтпуска.КоличествоДней;
			КонецЕсли;
			ТекстИнтервала = ТекстЭлемента(Параметры.ВариантОтображенияПериода, КоличествоДней);
			
			Если Параметры.ОтображатьПлан И Параметры.ОтображатьФакт Тогда
				Если СтрокаОтпуска.ВидОтпуска = ВидыОтпуска.График Тогда
					ЦветИнтервала = Параметры.Цвета.ЦветПланаПечать;
				Иначе
					ЦветИнтервала = Параметры.Цвета.ЦветФактаПечать;
				КонецЕсли;
				СерияОтпуска.ДополнительныйЦвет = Параметры.Цвета.ЦветФактаПечать;
			ИначеЕсли Не Параметры.ОтображатьПлан И Параметры.ОтображатьФакт Тогда
				Если СтрокаОтпуска.ВидОтпуска = ВидыОтпуска.ЗаявкаНеСогласованная Тогда
					ЦветИнтервала = Параметры.Цвета.ЦветПланаПечать;
				Иначе
					ЦветИнтервала = Параметры.Цвета.ЦветФактаПечать;
				КонецЕсли;
				СерияОтпуска.ДополнительныйЦвет = Параметры.Цвета.ЦветФактаПечать;
			Иначе
				ЦветИнтервала = Параметры.Цвета.ЦветФактаПечать;
			КонецЕсли;
			
			ПараметрыИнтервала.Вставить("ЦветИнтервала", ЦветИнтервала);
			ПараметрыИнтервала.Вставить("ТекстИнтервала", ТекстИнтервала);
			
			ДобавитьИнтервал(ПараметрыИнтервала);
			
			Если СтрокаОтпуска <> Неопределено Тогда
				ТочкаСотрудника.Текст = СтрокаОтпуска.СотрудникПредставление;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДобавитьИнтервал(Знач Параметры, ИнтервалДиаграммыГанта = Неопределено)
	
	ДиаграммаГанта = Параметры.ДиаграммаГанта;
	ТочкаДиаграммыГанта = Параметры.ТочкаДиаграммыГанта;
	Расшифровка = Параметры.Расшифровка;
	СерияИнтервала = Параметры.СерияИнтервала;
	ЦветИнтервала = Параметры.ЦветИнтервала;
	ТекстИнтервала = Параметры.ТекстИнтервала;
	
	Значение = ДиаграммаГанта.ПолучитьЗначение(ТочкаДиаграммыГанта, СерияИнтервала);
	
	Значение.Редактирование = Истина;
	
	Если ИнтервалДиаграммыГанта = Неопределено Тогда
		Интервал = Значение.Добавить();
		Интервал.Начало			= НачалоДня(Расшифровка.НачалоПериода);
		Интервал.Конец			= КонецДня(Расшифровка.ОкончаниеПериода);
		Интервал.Расшифровка	= Расшифровка.ДокументПланирования;
	Иначе
		Интервал = ИнтервалДиаграммыГанта;
	КонецЕсли;
	
	Интервал.Цвет = ЦветИнтервала;
	Интервал.Текст = ТекстИнтервала;
	Интервал.Значение.Текст = ТекстИнтервала;
	Значение.Текст = ТекстИнтервала;
	
	Возврат Интервал;
	
КонецФункции

&НаКлиенте
Процедура СоздатьЗаявкуНаОтпуск(ПараметрыЗаполнения = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура();
	Если ПараметрыЗаполнения <> Неопределено Тогда
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ПараметрыЗаполнения);
	КонецЕсли;
	
	ОткрытьФорму("Документ.ЗаявкаНаОтпуск.Форма.ФормаДокумента", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьСправкуПоОтпускам(Сотрудник) Экспорт
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.Сотрудники", "СправкаПоОтпускамСотрудника",
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сотрудник), ЭтотОбъект,
		Новый Структура("ДатаОстатков, ЭтоРасчетПриУвольнении", ТекущаяДатаСеансаССервера(), Ложь));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьФизическоеЛицо(Сотрудник)
	
	ФизическиеЛица = КадровыйУчет.ФизическиеЛицаСотрудников(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сотрудник));
	Возврат ФизическиеЛица[0];
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекущаяДатаСеансаССервера()
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаКлиенте
Процедура ИзменитьВариантПериода()
	
	ВыделитьПериодОтображения(ЭтотОбъект);
	ЗаполнитьЗначенияСвойств(ПериодДанных, ПериодДанных(ВариантОтображенияПериода, ДатаОтображения));
	УстановитьПредставлениеПериода(ЭтотОбъект);
	УстановитьЗаголовкиКнопокПериода(ЭтотОбъект);
	Если ВыделятьПраздничныеДни Тогда
		ЗаполнитьПраздничныеДни(ПраздничныеДни, ПроизводственныйКалендарь, ПериодДанных.ДатаНачала,
			ПериодДанных.ДатаОкончания);
	КонецЕсли;
	ОбновитьДанныеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВариантОтображения(ОтображатьПланНовоеЗначение, ОтображатьФактНовоеЗначение)

	ОтображатьПлан = ОтображатьПланНовоеЗначение;
	ОтображатьФакт = ОтображатьФактНовоеЗначение;
	ВыделитьВариантОтображения(ЭтотОбъект);
	НачатьОбновлениеДанныхНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПериодаОтображения()
	
	ЗаполнитьЗначенияСвойств(ПериодДанных, ПериодДанных(ВариантОтображенияПериода, ДатаОтображения));
	
	Планировщик.ТекущиеПериодыОтображения[0].Начало = ПериодДанных.ДатаНачала;
	Планировщик.ТекущиеПериодыОтображения[0].Конец = ПериодДанных.ДатаОкончания;
	
	ДиаграммаГанта.ИнтервалыФона.Очистить();
	ДиаграммаГанта.УстановитьПолныйИнтервал(ПериодДанных.ДатаНачала, ПериодДанных.ДатаОкончания);
	
	УстановитьПредставлениеПериода(ЭтотОбъект);
	УстановитьЗаголовкиКнопокПериода(ЭтотОбъект);
	Если ВыделятьПраздничныеДни Тогда
		ЗаполнитьПраздничныеДни(ПраздничныеДни, ПроизводственныйКалендарь, ПериодДанных.ДатаНачала,
			ПериодДанных.ДатаОкончания);
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбновитьДанныеНаКлиентеОтложенно", 1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеНаКлиентеОтложенно()
	ОбновитьДанныеНаКлиенте();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьПериодЗаявкиНаОтпуск(Параметры)

	Документы.ЗаявкаНаОтпуск.ИзменитьПериодЗаявки(Параметры.ЗаявкаНаОтпуск, Параметры.ДатаНачала,
		Параметры.ДатаОкончания);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПраздничныеДни(ПраздничныеДни, ПроизводственныйКалендарь, ДатаНачала, ДатаОкончания)
	
	ПраздничныеДниМассив = УчетРабочегоВремениРасширенный.ПраздничныеДниКалендаря(ПроизводственныйКалендарь,
		ДатаНачала, ДатаОкончания);
	ПраздничныеДни.ЗагрузитьЗначения(ПраздничныеДниМассив);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НоваяТаблицаПериодов()

	ТаблицаПериодов = Новый ТаблицаЗначений;
	ТаблицаПериодов.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	ТаблицаПериодов.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
	ТаблицаПериодов.Колонки.Добавить("КоличествоДней", Новый ОписаниеТипов("Число"));
	ТаблицаПериодов.Колонки.Добавить("ДокументОснование");
	ТаблицаПериодов.Колонки.Добавить("ДокументОснованиеПредставление", Новый ОписаниеТипов("Строка"));
	ТаблицаПериодов.Колонки.Добавить("ВидОтпуска", Новый ОписаниеТипов("Строка"));
	ТаблицаПериодов.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число"));
	ТаблицаПериодов.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	
	Возврат ТаблицаПериодов;

КонецФункции

&НаСервере
Функция ЕстьСохраненныеНастройки()
	
	УстановитьПривилегированныйРежим(Истина);
	Постфикс = "ТекущиеДанные";
	Если ЗначениеЗаполнено(КлючНазначенияИспользования) Тогда
		Постфикс = КлючНазначенияИспользования + "/" + Постфикс;
	КонецЕсли;
	Настройки = ОбщегоНазначения.ХранилищеСистемныхНастроекЗагрузить(ИмяФормы + "/" + Постфикс, "");
	
	Возврат ЗначениеЗаполнено(Настройки);
	
КонецФункции

&НаКлиенте
Процедура НачатьОбновлениеДанныхНаКлиенте(Команда = Неопределено)
	
	Планировщик.Элементы.Очистить();
	Планировщик.Измерения.Очистить();
	ДиаграммаГанта.Очистить();
	
	ДлительнаяОперация = ДанныеОтпусковДлительнаяОперацияНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьОбновлениеДанных", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ДанныеОтпусковДлительнаяОперацияНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение данных по отпускам для планировщика.'");
	ПараметрыВыполнения.АдресРезультата = АдресДанныеОтпусков;
	ПараметрыВыполнения.ДополнительныйРезультат = Истина;
	
	ПараметрыПланировщика = Новый Структура;
	ПараметрыПланировщика.Вставить("НачалоПериода", ПериодДанных.ДатаНачала);
	ПараметрыПланировщика.Вставить("ОкончаниеПериода", ПериодДанных.ДатаОкончания);
	ПараметрыПланировщика.Вставить("ПодразделениеСотрудник", ПодразделениеСотрудник);
	ПараметрыПланировщика.Вставить("ОтображатьПлан", ОтображатьПлан);
	ПараметрыПланировщика.Вставить("ОтображатьФакт", ОтображатьФакт);
	ПараметрыПланировщика.Вставить("Схема", ПолучитьИзВременногоХранилища(АдресСхемы));
	ПараметрыПланировщика.Вставить("НастройкиСхемыКомпоновки", КомпоновщикНастроек.ПолучитьНастройки());
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"Обработки.ДиаграммаОтпусков.ДанныеОтпусков", ПараметрыПланировщика);
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьОбновлениеДанных(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда // Пользователь отменил задание.
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ОбновитьДанныеНаСервере();
	Элементы.ВыделятьПраздничныеДни.Пометка = ВыделятьПраздничныеДни;
	УстановитьЗаголовокВидимостьКомандПроизводственногоКалендаря();
	УстановитьОтображениеДиаграммыГанта();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция МаксимальноеКоличествоОтображаемыхЭлементовИзмерения()
	Возврат 35;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВариантыПериода()
	
	Варианты = Новый Структура();
	Варианты.Вставить("Месяц", "Месяц");
	Варианты.Вставить("Квартал", "Квартал");
	Варианты.Вставить("Год", "Год");
	
	Возврат Варианты;
	
КонецФункции

&НаСервере
Процедура ПриЗагрузкеНастроек()
	
	ЗаполнитьЗначенияСвойств(ПериодДанных, ПериодДанных(ВариантОтображенияПериода, ДатаОтображения));
	
	Если ЗначениеЗаполнено(ПроизводственныйКалендарь) Тогда
		ЗаполнитьПраздничныеДни(ПраздничныеДни, ПроизводственныйКалендарь, ПериодДанных.ДатаНачала,
			ПериодДанных.ДатаОкончания);
	Иначе		
		ВыделятьПраздничныеДни = Ложь;
	КонецЕсли;
	
	УстановитьОтображениеЭлементов(ЭтотОбъект, ВыделятьПраздничныеДни);
	ПодразделениеСотрудникСтароеЗначение = ПодразделениеСотрудник;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстЭлемента(ВариантОтображенияПериода, КоличествоДней)

	Результат = "";
	Если ВариантОтображенияПериода <> ВариантыПериода().Год Тогда
		Результат = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru=';%1 день;;%1 дня;%1 дней;%1 дня'"), КоличествоДней, , "ЧН=0");
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаСервереБезКонтекста
Функция КоличествоДней(Знач Параметры)

	Сотрудник = Параметры.Сотрудник;
	ДатаНачала = Параметры.ДатаНачала;
	ДатаОкончания = Параметры.ДатаОкончания;
	
	КоличествоДней = УчетРабочегоВремениРасширенный.ДлительностьИнтервала(Сотрудник, ДатаНачала, ДатаОкончания);
	
	Возврат КоличествоДней;

КонецФункции

&НаСервере
Функция ПараметрыПолученияДанных()

	ПараметрыПолученияДанных = Новый Структура;
	ПараметрыПолученияДанных.Вставить("НачалоПериода", ПериодДанных.ДатаНачала);
	ПараметрыПолученияДанных.Вставить("ОкончаниеПериода", ПериодДанных.ДатаОкончания);
	ПараметрыПолученияДанных.Вставить("ПодразделениеСотрудник", ПодразделениеСотрудник);
	ПараметрыПолученияДанных.Вставить("ОтображатьПлан", ОтображатьПлан);
	ПараметрыПолученияДанных.Вставить("ОтображатьФакт", ОтображатьФакт);
	ПараметрыПолученияДанных.Вставить("Схема", ПолучитьИзВременногоХранилища(АдресСхемы));
	ПараметрыПолученияДанных.Вставить("НастройкиСхемыКомпоновки", КомпоновщикНастроек.ПолучитьНастройки());
	
	Возврат ПараметрыПолученияДанных;

КонецФункции

&НаСервере
Функция ПараметрыВывода()

	ПараметрыВывода = Новый Структура;
	ПараметрыВывода.Вставить("Цвета", Цвета);
	ПараметрыВывода.Вставить("ШрифтПодразделения", ШрифтыСтиля.ПодразделенияДиаграммыОтпусковШрифт);
	ПараметрыВывода.Вставить("ПериодДанных", ПериодДанных);
	ПараметрыВывода.Вставить("ВариантОтображенияПериода", ВариантОтображенияПериода);
	ПараметрыВывода.Вставить("ФизическоеЛицоТекущегоПользователя", ФизическоеЛицоТекущегоПользователя);
	ПараметрыВывода.Вставить("ОтображатьПлан", ОтображатьПлан);
	ПараметрыВывода.Вставить("ОтображатьФакт", ОтображатьФакт);

	Возврат ПараметрыВывода;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеОтпусков(ПараметрыПланировщика, АдресДанныеОтпусков, УникальныйИдентификатор)

	ДанныеОтпусков = ПолучитьИзВременногоХранилища(АдресДанныеОтпусков);
	Если ДанныеОтпусков = Неопределено Тогда
		ДанныеОтпусков = Обработки.ДиаграммаОтпусков.ДанныеОтпусков(ПараметрыПланировщика, УникальныйИдентификатор);
	КонецЕсли;

	Возврат ДанныеОтпусков;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТекстПериода(ДатаНачала, ДатаОкончания)
	Возврат СтрШаблон(НСтр(" ru = 'Отпуска за %1'"), ПредставлениеПериода(ДатаНачала, ДатаОкончания));
КонецФункции

&НаКлиенте
Процедура УстановитьЗаголовокОтборов()

	ПанельОтборовЗаголовок = НСтр("ru = 'Отборы'");
	КоличествоОтборов = КоличествоИспользуемыхОтборов(КомпоновщикНастроек);
	Если КоличествоОтборов > 0 Тогда
		ПанельОтборовЗаголовок = СтрШаблон("%1 (%2)", ПанельОтборовЗаголовок, Строка(КоличествоОтборов));
	КонецЕсли;
	Элементы.ОткрытьОтбор.Заголовок = ПанельОтборовЗаголовок;

КонецПроцедуры

&НаСервереБезКонтекста
Функция КоличествоИспользуемыхОтборов(КомпоновщикНастроек)

	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	КоличествоИспользуемыхЭлементовОтбора = 0;
	Для Каждого ЭлементОтбора Из Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.Использование Тогда
			КоличествоИспользуемыхЭлементовОтбора = КоличествоИспользуемыхЭлементовОтбора + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат КоличествоИспользуемыхЭлементовОтбора;

КонецФункции

&НаСервереБезКонтекста
Функция РезультатПоиска(Текст)

	Результат = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 20
		|	Сотрудники.Ссылка КАК Значение,
		|	Сотрудники.Представление КАК Представление,
		|	Сотрудники.Код КАК ДопИнформация
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Наименование ПОДОБНО &Текст
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтруктураПредприятия.Ссылка,
		|	СтруктураПредприятия.Представление,
		|	СтруктураПредприятия.Родитель.Наименование
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|ГДЕ
		|	СтруктураПредприятия.Наименование ПОДОБНО &Текст";
	
	Запрос.УстановитьПараметр("Текст", Текст + "%");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Представление = ВыборкаДетальныеЗаписи.Представление;
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДопИнформация) Тогда
			Представление = СтрШаблон(НСтр("ru = '%1 (%2)'"), ВыборкаДетальныеЗаписи.Представление,
				ВыборкаДетальныеЗаписи.ДопИнформация);
		Иначе
			Представление = СтрШаблон(НСтр("ru = '%1'"), ВыборкаДетальныеЗаписи.Представление);
		КонецЕсли;
		Результат.Добавить(ВыборкаДетальныеЗаписи.Значение, Представление);
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ИнициализироватьКомпоновщик()

	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	Схема = ОбъектОбработки.ПолучитьМакет("ИсточникОтборовСотрудников");
	АдресСхемы = ПоместитьВоВременноеХранилище(Схема, УникальныйИдентификатор);
	АдресДанныеОтпусков = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы);
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЦветаПланировщика() Экспорт

	Цвета = Новый Структура;
	Цвета.Вставить("ЦветПлана", ЦветаСтиля.ПлановыеОтпускаДиаграммыОтпусковЦвет);
	Цвета.Вставить("ЦветФакта", ЦветаСтиля.ФактическиеОтпускаДиаграммыОтпусковЦвет);
	Цвета.Вставить("ЦветЗаявки", ЦветаСтиля.ЗаявкаНаОтпускДиаграммыОтпусковЦвет);
	Цвета.Вставить("ЦветТекстаПодразделений", ЦветаСтиля.ПодразделенияДиаграммыОтпусковЦветТекста);
	Цвета.Вставить("ЦветФонаПодразделений", ЦветаСтиля.ПодразделенияДиаграммыОтпусковЦвет);
	Цвета.Вставить("ЦветФонаТекущегоСотрудника", ЦветаСтиля.ТекущийПользовательДиаграммыОтпусковЦвет);
	Цвета.Вставить("ЦветПраздничныхДней", ЦветаСтиля.ПраздничныеДниДиаграммыОтпусковЦвет);
	Цвета.Вставить("ЦветПланаПечать", ЦветаСтиля.ПлановыеОтпускаДляПечатиДиаграммыОтпусковЦвет);
	Цвета.Вставить("ЦветФактаПечать", ЦветаСтиля.ФактическиеОтпускаДляПечатиДиаграммыОтпусковЦвет);
	
	Возврат Цвета;

КонецФункции

&НаКлиенте
Процедура ОбновитьДанные(ДополнительныеПараметры = Неопределено) Экспорт
	ОбновитьДанныеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПустоеПодразделение()
	
	ПодразделениеСотрудник = ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка");
	Если ЗначениеЗаполнено(ПодразделениеСотрудникСтароеЗначение) Тогда
		НачатьОбновлениеДанныхНаКлиенте();
	КонецЕсли;
	ПодразделениеСотрудникСтароеЗначение = ПодразделениеСотрудник;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПриоритетыОтпусков() Экспорт

	Приоритеты = Новый Структура;
	Приоритеты.Вставить("План", 0);
	Приоритеты.Вставить("Факт", 1);
	
	Возврат Приоритеты;

КонецФункции

&НаСервереБезКонтекста
Функция РазрешенПросмотрДанныхСотрудника(ОграниченныйДоступ, Сотрудник, ФизическоеЛицоТекущегоПользователя,
	Документ = Неопределено)
	
	Результат = Истина;
	
	Если ОграниченныйДоступ Тогда
		Если Документ <> Неопределено И ТипЗнч(Документ) <> Тип("ДокументСсылка.ЗаявкаНаОтпуск") Тогда
			Результат = Ложь;
		ИначеЕсли ПолучитьФизическоеЛицо(Сотрудник) <> ФизическоеЛицоТекущегоПользователя Тогда
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьЗаголовокВидимостьКомандПроизводственногоКалендаря()
	
	Если ПроизводственныйКалендарь.Пустая() Тогда
		ПроизводственныйКалендарьТекст = НСтр("ru = '<не выбран>'");
	Иначе
		ПроизводственныйКалендарьТекст = СтрШаблон(НСтр("ru = '%1'"), Строка(ПроизводственныйКалендарь));
	КонецЕсли;
	
	Элементы.УстановитьПроизводственныйКалендарь.Заголовок = СтрШаблон(НСтр("ru = 'Производственный календарь: %1'"),
		ПроизводственныйКалендарьТекст);

	Если ВыделятьПраздничныеДни Тогда
		ЗаполнитьПраздничныеДни(ПраздничныеДни, ПроизводственныйКалендарь, ПериодДанных.ДатаНачала,
			ПериодДанных.ДатаОкончания);
	КонецЕсли;
	
	ОтобразитьПраздничныеДни();
	
КонецПроцедуры

&НаСервере
Функция ПроизводственныйКалендарьПоГрафикам(Графики)
	
	Результат = Справочники.ПроизводственныеКалендари.ПустаяСсылка();
	
	Значения = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Графики, "ПроизводственныйКалендарь", Истина);
	ПроизводственныеКалендари = ОбщегоНазначения.ВыгрузитьКолонку(Значения, "Значение", Истина);
	
	Если ПроизводственныеКалендари.Количество() = 1 Тогда
		Результат = ПроизводственныеКалендари[0];
	ИначеЕсли ПроизводственныеКалендари.Количество() > 1 Тогда
		Значения = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ПроизводственныеКалендари, "БазовыйКалендарь", Истина);
		БазовыеКалендари = ОбщегоНазначения.ВыгрузитьКолонку(Значения, "Значение", Истина);
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(БазовыеКалендари,
			Справочники.ПроизводственныеКалендари.ПустаяСсылка());
		Если БазовыеКалендари.Количество() = 1 Тогда
			Результат = БазовыеКалендари[0];
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьПериодЭлементаПоЗначению(ЭлементПланировщика)
	
	Реквизиты = ПолучитьПериодДокумента(ЭлементПланировщика.Значение);
	ЭлементПланировщика.Начало = Реквизиты.ДатаНачала;
	ЭлементПланировщика.Конец = Реквизиты.ДатаОкончания;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПериодДокумента(Документ)
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "ДатаНачала, ДатаОкончания");
	
КонецФункции

&НаСервереБезКонтекста
Функция ФизическиеЛицаСовпадают(Сотрудник, Документ)
	
	ФизическоеЛицоСотрудника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ФизическоеЛицо");
	ФизическоеЛицоДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ФизическоеЛицо");
	
	Возврат ФизическоеЛицоСотрудника = ФизическоеЛицоДокумента;
	
КонецФункции

#КонецОбласти
